
<style>
.footer {
    font-size: 1.3em;
    text-align: center;

    color: #fff;
    background-color: #26b9b1;
}
.header {
    display: flex;

    position: fixed;
    z-index: 99;

    width: 100%;
    min-width: 1217px;

    background: rgba(81, 90, 110, .8);

    align-items: center;
}
.footer-span {
    margin: 0 0 0 94px;
}
.container {
    position: relative;

    width: 100%;
    min-height: 100vh;

    background: url('../style/images/bg5.png');
    background-repeat: no-repeat;
    background-size: 100% 100%;
    display: flex;
    justify-content: center;
    align-items: center;
}
.container-right,
.container-left {
    height: 84vh;
    background: #fff;
    border: 2px solid #000;
    border-radius: 2em;
    margin: 16px 0 0 0px;
}
.container-left {
    width: 20%;
    padding: 36px 0 0 24px;
    color:#000;
}
.container-right {
    width: 62%;
    margin-left: 56px;
    color:#000;
        padding: 30px;
        overflow: auto;
}
.pointer {
    color: #000;
    background: #000;
    border-radius: 5em;
    font-size: 0.1em;
    margin: 0 20px 0 0;
    letter-spacing: 0;
}
.title-choose {
        display: flex;
    align-items: center;
    letter-spacing: 6px;
    /* padding: 0 0 0 24px; */
}
.teacher-name {
    display: flex;
    flex-flow: wrap;
    padding: 20px 0 0px 22px;
    height: 166px;
}
.teacher-name div {
    width: 60px;
    text-align: center;
    font-size: 1.3em;
    cursor: pointer;
}
.isClicked {
    /* text-decoration: underline; */
    border-bottom: 2px solid #000;
}
.title-commom {
    margin: 20px 0;
    cursor:pointer;
}
.image-container {
    width: 160px;
    height: 20vh;
    float: right;
    margin: 36px 40px 20px 20px;
    display: flex;
    justify-content: center;
    align-items: center;
    border: 2px solid #000;
}
.image-container img {
    width: 94%;
    height: 94%;
}
.person-introduce {
    color:#26b9b1;
    margin: 10px 0;
    font-size: 1.3em;
}
.container-right h1{
 font-size: 2.5em;
}
.person-context {
    text-indent:2em;
}

.person-page {
    padding: 0 0 0 2em;
}

.test-container {
    float: left;
    width: 30%;
    margin: 20px 1.5%;
    text-align: center;
    font-size: 1.1rem;
}
.img-center {
    display: block;
    margin-left: center;
    margin-right: center;
}
.container-right img {
    width: 100%;
}
</style>
<template>
    <Layout>
        <Header class="header">
            <navheader  v-bind:clicknav="index"></navheader>
        </Header>
        <Content>
           <div class="container">
               <div class="container-left">
                   <div >
                       <h1 class="title-choose title-commom" @click="chooseTitle(10)"><Icon type="ios-radio-button-off" class="pointer" /><span v-bind:class="[chooseIndex == 10 ? 'isClicked' : null]">实验计划</span></h1>
                   </div>
                   <div>
                       <h1 class="title-choose title-commom" @click="chooseTitle(11)"><Icon type="ios-radio-button-off" class="pointer" /><span v-bind:class="[chooseIndex == 11 ? 'isClicked' : null]">课程设计</span></h1>
                   </div>
                   <div>
                       <h1 class="title-choose title-commom" @click="chooseTitle(12)"><Icon type="ios-radio-button-off" class="pointer" /><span v-bind:class="[chooseIndex == 12 ? 'isClicked' : null]">实验指导书</span></h1>
                   </div>
                   <div>
                       <!-- <h1 class="title-choose title-commom" @click="chooseTitle(13)"><Icon type="ios-radio-button-off" class="pointer" /><span v-bind:class="[chooseIndex == 13 ? 'isClicked' : null]">课程规划</span></h1> -->
                   </div>
               </div>
               <!-- 课程简介 -->
               <div class="container-right" v-if="chooseIndex == 10">
                  <h1>实验计划</h1>
                  <br>
                  <h2>此实验计划一共有五个实验，点击下方即可下载各个实验。</h2>
                  <div class="test-container">
                      <div>
                          <span>题目</span>
                          <span>实验一</span>
                          <a :href="fileIP + '/practical/report/' + '1.docx'" download="">点击下载</a>
                      </div>
                      <div>
                          <span>答案</span>
                          <span>实验一</span>
                          <a :href="fileIP + '/practical/answer/' + '1.docx'" download="">点击下载</a>
                      </div>
                  </div>
                  <div class="test-container">
                      <div>
                          <span>题目</span>
                          <span>实验二</span>
                          <a :href="fileIP + '/practical/report/' + '2.docx'" download="">点击下载</a>
                      </div>
                      <div>
                          <span>答案</span>
                          <span>实验二</span>
                          <a :href="fileIP + '/practical/answer/' + '2.docx'" download="">点击下载</a>
                      </div>
                  </div>
                  <div class="test-container">
                      <div>
                          <span>题目</span>
                          <span>实验三</span>
                          <a :href="fileIP + '/practical/report/' + '3.docx'" download="">点击下载</a>
                      </div>
                      <div>
                          <span>答案</span>
                          <span>实验三</span>
                          <a :href="fileIP + '/practical/answer/' + '3.docx'" download="">点击下载</a>
                      </div>
                  </div>
                  <div class="test-container">
                      <div>
                          <span>题目</span>
                          <span>实验四</span>
                          <a :href="fileIP + '/practical/report/' + '4.docx'" download="">点击下载</a>
                      </div>
                      <div>
                          <span>答案</span>
                          <span>实验四</span>
                          <a :href="fileIP + '/practical/answer/' + '4.docx'" download="">点击下载</a>
                      </div>
                  </div>
                  <div class="test-container">
                      <div>
                          <span>题目</span>
                          <span>实验五</span>
                          <a :href="fileIP + '/practical/report/' + '5.docx'" download="">点击下载</a>
                      </div>
                      <div>
                          <span>答案</span>
                          <span>实验五</span>
                          <a :href="fileIP + '/practical/answer/' + '5.docx'" download="">点击下载</a>
                      </div>
                  </div>
                  <div class="test-container">
                      <div>
                          <span>题目</span>
                          <span>实验汇总</span>
                          <a :href="fileIP + '/practical/report/' + 'all.docx'" download="">点击下载</a>
                      </div>
                      <div>
                          <span>答案</span>
                          <span>实验汇总</span>
                          <a :href="fileIP + '/practical/answer/' + 'all.docx'" download="">点击下载</a>
                      </div>
                  </div>
               </div>
               <!-- end课程简介 -->
                <!-- 教学大纲   -->
                <div class="container-right" v-if="chooseIndex == 11">
                    <h1>课程设计</h1>
                    <br>
                    <h2>一、课程设计目的</h2>
                    <p> 1.进一步掌握和利用C语言进行程设计的能力；<br>
                        2.进一步理解和运用结构化程设计的思想和方法；<br>
                        3.初步掌握开发一个小型实用系统的基本方法；<br>
                        4.学会调试一个较长程序的基本方法；<br>
                        5.学会利用流程图或N-S图表示算法；<br>
                        6.掌握书写程设计开发文档的能力（书写课程设计报告）。</p>
                    <h2>二、 课程设计分1、2、 3三个难度。合格为60分，评分等级为优秀、 良好、 中等、 及格、不及格五个级别。</h2>
                    <p>（1）完成指定的功能，难度越大，分数愈高；
                       （2）在完成指定功能的基础上，添加扩展功能，有创意，且成功实现，给与一定的加分；
                       （3）未完成或有错误，酌情给分</p>
                       <br>
                    <img class="img-center" src="../style/images/1.png" alt="">
                    <h2>三、课程设计要求独立完成，严禁抄袭。</h2>
                    <h2>四、要求</h2>
                    <p>1.只能使用 C 语言，工具采用 TC2.0 或 3.0，源程序要有适当的注释，使程
                        序容易阅读，所有程序要求使用多文件多函数编程方式。<br>
                        2.要有用户界面。要求至少采用文本菜单界面；鼓励采用图形菜单界面，
                        使用文件保存数据，鼓励自行增加新功能。<br>
                        3.写课程设计报告（要求正规打印，A4 幅面，双面打印），内容包括：<br>
                        · 封面（以附件格式为主）<br>
                        · 课程设计题目、内容、要求。<br>
                        · 总体设计（包含几大功能模块），画出系统功能模块结构图<br>
                        · 详细设计（各功能模块的具体实现，画出相关流程图）<br>
                        · 公用数据结构设计及用法说明<br>
                        · 各函数模块的功能介绍，程序结构（画流程图），数据结构设计描述，参
                        数说明等。（画流程图推荐使用 Microsoft Visio 工具。）<br>
                        · 试验结果（包括输入数据和输出结果）<br>
                        · 体会，总结（课程设计完成了哪些功能，有什么扩展功能 有什么地方需
                        要改进，通过课程设计有何收获，调试程序的体会等）<br>
                        · 参考文献<br>
                        · 附录：程序清单<br>
                        4.格式：正文字体 宋体 五号 行距 1.25 倍<br>
                        5.附：封面格式<br>
                        四、应提交材料<br>
                        1、课程设计报告（doc 格式）（提交时按学号顺序排放）要求有统一的封
                        面。除封面外要求双面打印。<br>
                        2、每个班交一张光盘，包含所有学生的资料，每个学生的资料放在以学号
                        姓名命名的文件夹中（源程序（*.c），应用程序，所需文件，课程设计报告文
                        档电子档案，使用手册）。</p>
                    <h2>C 课程设计题目第一套 难度：1 <br> 题目：一卡通消费记录管理系统</h2>
                    <p>
                        一、 功能需求说明(必须采用结构体和动态链表实现) <br>
                        1. 消费记录存在文件fee.txt中,格式如下：<br>
                        每一条记录包括一个消费的交易日期、入账日期、交易额、交易后余额、交易类型、交易次数、交易
                        地点。示例如下
                        <img class="img-center" src="../style/images/4.png" alt="">
                        2．查询搜索功能<br>
                        （1）用户能够查询自己的一卡通固定时段消费情况：可以按月、学期、学年查询<br>
                        （2） 用户可以自定义一个时间段进行查询自己的消费情况<br>
                        <img src="../style/images/8.png" alt="">
                        （3）用户可以按交易金额查找消费记录<br>
                        （4）管理员可查询任一用户的消费记录，可按照固定时段、自定义时段、金额方式、已删除记录查询<br>
                        3.排序功能：按消费记录的交易日期、金额、次数中一个进行（升序或降序）排序。<br>
                        4．数据录入：管理员能录入某个用户的一卡通消费情况，可以一次完成若干条记录的输入。<br>
                        5.显示功能：可进行全部消费记录的显示，也可按照查询结果进行显示<br>
                        6.数据变更：管理员可以更改或删除用户的某条消费记录，但删除的信息要保存在另外一个文件
                        fee_undel.dat<br>
                        7.统计功能：（1）用户可统计自己在一个自定义时间段里的消费总金额情况<br>
                        （2）管理员可统计各个用户在一个自定义时间段里的消费总金额情况<br>
                        8. 用户和管理员的权限要分开。<br>
                        二、加分项<br>
                        1.使用图形界面。<br>
                        2.使用线、图表示查询记录和统计消费结果<br>
                        3.可参考实际情况对软件进行功能扩充<br>
                        三、 设计要求<br>
                        1.校园卡消费记录文件为 fee.txt，所有消费记录以交易日期从小到大排序（该文件自行建立）。要求编
                        程序实现查询、排序、统计、录入、更新等功能。具体要求如下：<br>
                        （1）要求显示如下界面<br>
                        **************************************************************************<br>
                        1------查询 2------排序 3------统计 4------录入 5------更新<br>
                        **************************************************************************<br>
                        通过选择 1-4 来确定要做哪一个操作。<br>
                        （2）若选择 1 则出现如下界面<br>
                        **************************************************************************<br>
                        1-----按固定时段查询 2-----按日期区间段查询 3-----按交易金额查询<br>
                        4-----已删除记录查询（管理员才有此项功能）<br>
                        **************************************************************************<br>
                        通过选择 1-4 来确定操作,有符合的记录输出到屏幕，若无，则输出相关提示信息。<br>
                        2．若选 2，按消费记录的交易日期、金额、次数中一个进行（升序或降序）排序。<br>
                        3．若选 3，统计一个时间段里的消费总金额统计，并显示结果。<br>
                        4. 若选 4，删除指定的消费记录，并把删除后剩下的数据保存到文件 fee_del.txt 中。<br>
                        5．不同的模块都要有出错处理，并能给出出错提示。如输入数据错误，文件操作错误等等<br>
                        6．以上各个功能均编写成子函数，有良好的注释说明，由主函数调用实现。<br>
                        7．必须采用结构体和动态链表实现对消费记录数据的存储和访问；<br>
                        8. 必须使用文件保存数据<br>
                        9.应提供一个界面来调用各个功能,调用界面和各个功能的操作界面应尽可能清晰美观<br>
                        二、测试数据要求<br>
                        (1)不少于 3 个学生的消费记录；(2)不少于 10 个月的消费记录；<br>
                        (3)每个月的消费不少于 5 个； (4)删除的消费记录不少于 20 条； </p>
                        <h2>C 课程设计题目第二套 难度：2<br> 题目：个人邮箱系统</h2>
                        <p>                        
   
                            在结构体数组的基础上，设计要求如下：<br>
                            个人邮箱系统主要包含是两个子模块：（1）通讯录（2）邮件管理<br>
                            一、通讯录<br>
                            该功能根据用户对联系人的分组规划联系人的联系方式，存储用户联系人的联系方式，并对联系方式
                            和分组情况进行管理。<br>
                            通讯录具体信息如下<br>
                            <img class="img-center" src="../style/images/7.png" alt="">
                            分组信息如下<br>
                            <img class="img-center" src="../style/images/3.png" alt="">
                            1. 添加通讯录：根据类别对登陆用户的关系人进行区分，添加新联系人的通讯方式，用户录入联系
                            人的具体信息。提交后存储入数据文件后，自动生成该联系人通讯方式的编号，存储成功后，显示该类别
                            所有联系人的通讯方式。<br>
                            2.查看通讯录：用户选择查询的条件比如：用户名，邮件地址，手机号码，分组等条件，系统返回和
                            用户输入条件相似的结果。<br>
                            3.修改通讯录：用户选择要修改的联系人的通讯方式，点击查看详细信息，进行修改提交后，更新数
                            据文件中的数据更新成功后，显示当前联系人的通讯方式详细信息。<br>
                            4.删除通讯录：用户选择要删除的联系人，点击删除，数据文件中的数据删除成功后，返回选择系统
                            用户的页面。<br>
                            5.类别管理<br>
                            （1）添加分组类别：用户录入类别名称，提交存储入数据文件，自动生成类别编号存储成功后显示
                            所有类别。<br>
                            （2）检索类别：用户查看所有的分类。<br>
                            （3）修改类别名称：管理员选择要修改的类别，点击修改，显示类别名称修改，提交后数据文件后，
                            更新成功后，显示所有的分类。<br>
                            （4）删除类别：管理员选择要删除的类别，点击删除，该类别下的所有用户的通讯方式都自动转移
                            到默认的分组（朋友）中。数据删除数据成功后，显示所有的分类。默认分组不可删除。<br>
                            二、邮件管理<br>
                            该模块提供对邮件的管理功能，可以草稿箱、接收邮件（收件箱）、发送邮件、删除邮件（垃圾箱）、
                            查看邮件、查找邮件，并可以将已有的邮件程进行显示。详细功能如下<br>
                            1.草稿箱：用户可编写新的邮件，或对未编辑完成的邮件进行保存。邮件内容如下。<br>
                            <img class="img-center" src="../style/images/5.png" alt="">
                            2.接收邮件（收件箱）：每次登陆系统后可自动接收邮件，也可通过用户手动接收。<br>
                            3.发送邮件：用户可对草稿箱中的邮件进行人工发送<br>
                            4.删除邮件（垃圾箱）：用户可对邮件进行删除，删除后的邮件放入垃圾箱<br>
                            5.查看邮件：用户可以对任意邮件进行查看、并可进行编辑、查找、转发功能<br>
                            6.查找邮件：用户选择查询的条件比如：用户名，邮件地址，手机号码，分组等条件查询邮件，系统
                            返回和用户输入条件相似的结果。<br>
                            7.邮件状态转换：可手动将邮件状态进行切换（已读-》未读，未读-》已读）<br>
                            三、 设计要求<br>
                            1.通讯录数据放入指定文件：Adress.txt,邮件数据放入 mail.txt<br>
                            2.不同的模块都要有出错处理，并能给出出错提示。如输入数据错误，文件操作错误等等<br>
                            3．以上各个功能均编写成子函数，有良好的注释说明，由主函数调用实现。<br>
                            4．必须采用结构体数组现对通讯录和邮件记录数据的存储和访问，采用链表结构不加分；<br>
                            5. 必须使用文件保存数据<br>
                            6.应提供一个界面来调用各个功能,调用界面和各个功能的操作界面应尽可能清晰美观<br>
                            三、测试数据要求<br>
                            （1）通讯录不少于 5 人信息；（2）每人邮箱不少于 20 封邮件；
                            （3）每人邮箱：草稿箱：不少于 6 封；收件箱：不少于 10 封；垃圾箱：不少于 4 封</p>
                            <h2>C 课程设计题目第三套 难度：3<br>
                            题目：学生考勤信息管理系统</h2>
                            <p>
                                1 建立文件<br>
                                (1)考勤记录文件使用指定文件名 ARecord.txt；<br>
                                (2)可以不保存输入记录，但需要确认是否保存输入记录<br>
                                2.文件的存取和显示<br>
                                (1)可以单独存取文件；<br>
                                (2)可以随时显示内存中记录的全部内容；<br>
                                3 删除记录<br>
                                (1)可以按“学号”或“姓名”方式删除记录；<br>
                                (2)能给出被删除的信息，进行删除，如果没有要删除的信息，输出没有找到的信息；<br>
                                4 查询记录<br>
                                (1)可以按“姓名”或“学号”方式查询个人信息和考勤登记信息记录<br>
                                (2)可以按“任课教师”或“课程名称”方式查询课程信息<br>
                                (3)能给出查询记录的信息；<br>
                                (4)如果查询的信息不存在，输出没有找到的信息；<br>
                                5 统计记录<br>
                                (1)可以显示某生某门课考勤信息，并统计各类违纪情况次数<br>
                                (2)可以显示某人所有门课考勤信息，并统计各类违纪情况次数<br>
                                (3)可以显示某班所有课程考勤信息，并统计各类违纪情况次数<br>
                                6 备份功能<br>
                                (1) 编写函数 Backupdata 实现将 ARecord.txt 内容复制到备份文件 backup.txt 中，要求不能使用该两个
                                文件以外的任何文件。<br>
                                7 整体功能<br>
                                (1)可以随时检索、删除、或增加新记录，保存或取消新的记录<br>
                                (2)姓名可由 16 位字符和数字的混合编码组成<br>
                                (3)使电话号码可由 11 位字符和数字组成 <br>
                                (4)将输出信息加上输出信息栏，例如<br>
                                7 测试数据要求<br>
                                (1)不少于 3 门课信息（高数、英语、程序设计）。<br>
                                (2)不少于 1 个班，每班不少于 10 个同学。每人每门课的考勤信息不少于 5 次。 
                                <img class="img-center" src="../style/images/2.png" alt="">
                                </p>
               </div>
               <!-- end教学大纲   -->
               <!-- 学习指南-->
                <div class="container-right" v-if="chooseIndex == 12">
                    <h1>实验指导书</h1><br>
                    <p>
                        <img src="../style/images/9.png" alt="">
                        上机实验目的与要求 <br>
                        一、实验目的 <br>
                            上机实验是学习程序设计语言必不可少的实践环节，特别是 C 语言灵活、
                        简洁，更需要通过编程的实践来真正掌握它。对于程序设计语言的学习目的，
                        可以概括为学习语法规定、掌握程序设计方法、提高程序开发能力，这些都必
                        须通过充分的实际上机操作才能完成。 <br>
                            学习 C 程序设计语言除了课堂讲授以外，必须保证有不少于课堂讲授
                        学时的上机时间。因为学时所限，课程不能安排过多的统一上机实验，所以希
                        望学生有效地利用课程上机实验的机会，尽快掌握用 C 语言开发程序的能力，
                        为今后的继续学习打下一个良好的基础。课程上机实验的目的，不仅仅是验证
                        教材和讲课的内容、检查自己所编的程序是否正确，课程安排的上机实验的目
                        的可以概括为如下几个方面： <br>
                        1．加深对课堂讲授内容的理解 <br>
                            课堂上要讲授许多关于 C 语言的语法规则，听起来十分枯燥无味，也
                        不容易记住，死记硬背是不可取的。然而要使用 C 语言这个工具解决实际问题，
                        又必须掌握它。通过多次上机练习，对于语法知识有了感性的认识，加深对它
                        的理解，在理解的基础上就会自然而然地掌握 C 语言的语法规定。对于一些内
                        容自己认为在课堂上听懂了，但上机实践中会发现原来理解的偏差，这是由于
                        大部分学生是初次接触程序设计，缺乏程序设计的实践所致。 <br>
                            学习 C 语言不能停留在学习它的语法规则，而是利用学到的知识编写 C
                        语言程序，解决实际问题。即把 C 语言作为工具，描述解决实际问题的步骤，
                        由计算机帮助我们解题。只有通过上机才能检验自己是否掌握 C 语言、自己编
                        写的程序是否能够正确地解题。 <br>
                            通过上机实验来验证自己编制的程序是否正确，恐怕是大多数同学在
                        完成老师作业时的心态。但是在程序设计领域里这是一定要克服的传统的、错
                        误的想法。因为在这种思想支配下，可能你会想办法去"掩盖"程序中的错误，
                        而不是尽可能多地发现程序中存在的问题。自己编好程序上机调试运行时，可
                        能有很多你想不到的情况发生，通过解决这些问题，可以逐步提高自己对 C 语
                        言的理解和程序开发能力。 <br>
                        2．熟悉程序开发环境、学习计算机系统的操作方法 <br>
                            一个 C 语言程序从编辑、编译、连接到运行，都要在一定的外部操作
                        环境下才能进行。所谓"环境"就是所用的计算机系统硬件、软件条件，只有学
                        会使用这些环境，才能进行程序开发工作。通过上机实验，熟练地掌握 C 语言
                        开发环境，为以后真正编写计算机程序解决实际问题打下基础。同时，在今后
                        遇到其它开发环境时就会触类旁通，很快掌握新系统的使用。 <br>
                            本书中所采用的 C 语言开发环境为 Borland 公司的 Turbo C2.0 集成开
                        发环境（以下简称 TC 环境）。 <br>
                        3．学习上机调试程序 <br>
                            完成程序的编写，决不意味着万事大吉。你认为万无一失的程序，实
                        际上机运行时可能不断出现麻烦。如编译程序检测出一大堆语法错误：scanf( )
                        函数的输入表中出现非地址项、某变量未进行类型定义、语句末尾缺少分号等。
                        有时程序本身不存在语法错误，也能够顺利运行，但是运行结果显然是错误的。
                        开发环境所提供的编译系统无法发现这种程序逻辑错误，只能靠自己的上机经
                        验分析判断错误所在。程序的调试是一个技巧性很强的工作，对于初学者来说，
                        尽快掌握程序调试方法是非常重要的。有时候一个消耗你几个小时时间的小小
                        错误，调试高手一眼就看出错误所在。 <br>
                            经常上机的人见多识广，经验丰富，对出现的错误很快就有基本判断，
                        通过 C 语言提供的调试手段逐步缩小错误点的范围，最终找到错误点和错误原
                        因。这样的经验和能力只有通过长期上机实践才能取得。向别人学习调试程序
                        的经验当然重要，但更重要的是自己上机实践，分析、总结调试程序的经验和
                        心得。别人告诉你一个经验，当时似乎明白，当出现错误时，由于情况千变万
                        化，这个经验不一定用得上，或者根本没有意识到使用该经验。只有通过自己
                        在调试程序过程中的经历并分析总结出的经验才是自己的。一旦遇到问题，这
                        些经验自然涌上心头。所以调试程序不能指望别人替代，必须自己动手。分析
                        问题，选择算法，编好程序，只能说完成一半工作，另一半工作就是调试程序、
                        运行程序并得到正确结果。  <br>
                        二、实验要求 <br>
                            上机实验一般经历上机前的准备（编程）、上机调试运行和实验后的总
                        结三个步骤。 <br>
                        1．上机前的准备 <br>
                            根据问题，进行分析，选择适当算法并编写程序。上机前一定要仔细
                        检查程序（称为静态检查）直到找不到错误（包括语法和逻辑错误）。分析可
                        能遇到的问题及解决的对策。准备几组测试程序的数据和预期的正确结果，以
                        便发现程序中可能存在的错误。 <br> 
                            上机前没有充分的准备，到上机时临时拼凑一个错误百出的程序，宝
                        贵的上机时间白白浪费了；如果抄写或复制一个别人编写的程序，到头来自己
                        一无所获。 <br>
                        2．上机输入和编辑程序，并调试运行程序 <br>
                            首先调用 C 语言集成开发环境，输入并编辑事先准备好的源程序；然
                        后调用编译程序对源程序进行编译，查找语法错误，若存在语法错误，重新进
                        入编辑环境，改正后再进行编译，直到通过编译，得到目标程序（扩展名为 OBJ）。
                        下一步是调用连接程序，产生可执行程序（扩展名为 EXE）。使用预先准备的测
                        试数据运行程序，观察是否得到预期的正确结果。若有问题，则仔细调试，排
                        除各种错误，直到得到正确结果。在调试过程中，要充分利用 C 语言集成开发
                        环境提供的调试手段和工具，例如单步跟踪、设置断点、监视变量值的变化等。
                        整个过程应自己独立完成。不要一点小问题就找老师，学会独立思考，勤于分
                        析，通过自己实践得到的经验用起来更加得心应手。 <br>
                        3．整理上机实验结果，写出实验报告 <br>
                            实验结束后，要整理实验结果并认真分析和总结，根据教师要求写出
                        实验报告。 <br>
                            实验报告一般包括如下内容： <br>
                            ⑴ 实验内容 <br>
                            实验题目与要求。 <br>
                            ⑵ 算法说明 <br>
                            用文字或流程图说明。 <br>
                            ⑶ 程序清单 <br>
                            ⑷ 运行结果 <br>
                            原始数据、相应的运行结果和必要的说明。 <br>
                            ⑸ 分析与思考 <br>
                            调试过程及调试中遇到的问题及解决办法；调试程序的心得与体
                        会；其他算法的存在与实践等。若最终未完成调试，要认真找出错误并分析原
                        因等。 <br>
                        实验一  C 程序的运行环境和运行 C 程序的方法 <br>
                        
                        实验项目名称：C 程序的运行环境和运行 C 程序的方法 <br>
                        实验项目性质：普通实验 <br>
                        所属课程名称：C 语言程序设计 <br>
                        实验计划学时：1 <br>
                        
                        一、 实验目的 1.了解所用的计算机系统的基本操作方法，学会独立使用该系统。 <br>
                        2.了解在该系统上如何编辑、编译、连接和运行一个 C 程序。 <br>
                        3.通过运行简单的 C 程序，初步了解 C 源程序的特点。 <br>
                        二、 实验内容和要求 <br>
                        （1） 检查所用的计算机系统是否已安装了 C 编译系统并确定它所在的子目录。 <br>
                        （2） 进入所用的集成环境。 <br>
                        （3） 熟悉集成环境的界面和有关菜单的使用方法。 <br>
                        （4） 输入并运行一个简单的、正确的程序。 <br>
                        输入下面的程序（教材第一章例 1.1）： <br>
                        #include&lt;stdio.h&gt; <br>
                        void  main() <br>
                        { <br>
                            Printf(＂This is a c program.\n＂)； <br>
                        ｝ <br>
                        ①根据本书第二部分介绍的方法对源程序进行编译，观察屏幕上显示的编译
                        信息．如果出现“出错信息”，则应找出原因并改正之。再进行编译，如果无错，
                        则进行连接。 <br>
                        ②如果编译连接无错误，使程序运行，观察分析运行结果。 <br>
                        （5） 输入并编译一个有错误的 C 程序。 <br>
                        ①输入以下程序（教材第一章中例 1.2，故意打或打错几个字符）。 <br>
                        #include&lt;stdio.h&gt; <br>
                        void  main() <br>
                        {int a，b，sum <br>
                        a=123；b=456； <br>
                        sum=a+b <br>
                        print("sum is %d\n＂，sum)；  <br>
                        ｝ <br>
                        ②进行编译，仔细分析编译信息窗口，可能显示有多个错误，逐个修改，直
                        到不出现错误。最后请与教材上的程序对照。 <br>
                        ③使程序运行，分析运行结果。 <br>
                        （6） 输入并运行一个需要在运行时输入数据的程序。 <br>
                        ①输入下面的程序： <br>
                        #include&lt;stdio.h&gt; <br>
                        void  main() <br>
                        {int max(int x,int y)； <br>
                        int a，b，c； <br>
                        printf(＂input a &amp; b：＂)； <br>
                        scanf(＂％ d，％ d＂，＆a，＆b)； <br>
                        c=max(a，b)； <br>
                        printf(＂max=%d\n＂， c )； <br>
                        ｝ <br>
                        Int max(int x，int y) <br>
                        {int z； <br>
                        If (x&gt;y) z=x； <br>
                        else z=y； <br>
                        return(z)； <br>
                        ｝ <br>
                        ②编译并运行，在运行时从键盘输入整数２和５，然后按“回车”键，观察
                        运行结果。 <br>
                        ③将程序中的第三行改为 <br>
                        int a；b；c； <br>
                        再进行编译，观察其结果。 <br>
                        ④将 max 函数中的第 3、4 两行合并写为一行，即 <br>
                        if (x&gt;y) z=x；else z=y； <br>
                        进行编译和运行，分析结果。 <br>
                        （7） 运行一个自己编写的程序。题目是教材第一章的习题 1.6。即输入 a、b、<br>
                        c3 个值，输出其中最大者。 <br>
                        ①输入自己编写的源程序。 <br>
                        ②检查程序有无错误（包括语法错误和逻辑错误），有则改之。 <br>
                        ③编译和连接，仔细分析编译信息，如有错误应找出原因并改正之。 <br>
                        ④运行程序，输入数据，分析结果。 <br>
                        ⑤自己修改程序（例如故意改成错的），分析其编译和运行情况。 <br>
                        ⑥将调试好的程序保存在自己的用户目录中，文件名自定。 <br>
                        ⑦将编辑窗口清空，再将该文件读入，检查编辑窗口中的内容是否刚才存盘
                        的程序。 <br>
                        ⑧关闭所用的集成环境，用 Windows 的“我的电脑”找到刚才使用的用户子
                        目录。浏览其中文件，看有无刚才保存的后缀为 .c 和 .exe 的文件。 <br>
                        
                        
                        实验二  数据类型、运算符和表达式 <br>
                        
                        实验项目名称：数据类型、运算符和表达式 <br>
                        实验项目性质：普通实验 <br>
                        所属课程名称：C 语言程序设计 <br>
                        实验计划学时：1 <br>
                        
                        一、实验目的 <br>
                        1.掌握 C 语言数据类型，熟悉如何定义一个整型、字符型、实型变量，以及对
                        它们赋值的方法，了解以上类型数据输出时所用格式转换符。 <br>
                        2.掌握不同的类型数据之间赋值的规律。 <br>
                        3.学会使用 C 的有关算术运算符，以及包含这些运算符的表达式，特别是自加
                        (++)和自减(--)运算符的使用。 <br>
                        4.进一步熟悉 C 程序的编辑、编译、连接和运行的过程。 <br>
                        二、实验内容和要求 <br>
                        （1） 输入并运行下面的程序  <br>
                        main(  )  <br>
                        { char c1,c2；  <br>
                            c1=′a′；  <br>
                            c2=′b′；  <br>
                            printf("%c%c\n",c1,c2)；  <br>
                        }  
                        ① 运行此程序。  <br>
                        ② 在此基础上增加一个语句： printf("%d %d\n",c1,c2)；  <br>
                        再运行，并分析结果。  <br>
                        ③ 将第 2 行改为： int c1,c2； 再使之运行，并观察结果。  <br>
                        ④ 再将第 3、4 行改为： <br>
                        c1=a；     /*不用单撇号*/  <br>
                        c2=b；  <br>
                        现使之运行，分析其运行结果。 <br>
                        ⑤ 再将第 3、4 行改为：  <br>
                        c1="a"；    /*用双撇号*/  <br>
                        c2="b"；  <br>
                        再使之运行，分析其运行结果。  <br>
                        ⑥ 再将第 3、4 行改为：  <br>
                        cl=300；         /*用大于 255 的整数*/  <br>
                        c2=400；  <br>
                        再使之运行，分析其运行结果。  <br>
                        (2) 输入并运行以下程序  <br>
                        main(  )  <br>
                        { char cl=′a′,c2=′b′,c3=′c′,c4=′\101′,c5=116′  <br>
                        printf("a%c b%c\tc%c\tabc\n",cl,c2,c3)；  <br>
                        printf("\t\b%c%c",c4,c5)；  <br>
                        }  <br>
                        在上机前先用人工分析程序，写出应得结果，上机后将二者对照。  <br>
                        (3) 输入并运行下面的程序  <br>
                        main(  )  <br>
                        { int a,b；  <br>
                        unsigned c,d；  <br>
                        long e,f；  <br>
                        a=100；  <br>
                        b=-100； <br>
                        e=50000； <br>
                        f=32767；  <br>
                        c=a；  <br>
                        d=b；  <br>
                        printf("%d,%d\n",a,b)； <br>
                        printf("%u,%u\n",a,b)；  <br>
                        printf("%u,%u\n",c,d)； <br>
                        c=a=e；  <br>
                        d=b=f； <br>
                        printf("%d,%d\n",a,b)；  <br>
                        printf("%u,%u\n",c,d)；  <br>
                        }  <br>
                        请对照程序和运行结果分析：  <br>
                        ① 将一个负整数赋给一个无符号的变量，会得到什么结果。画出它们在内
                        存中的表示形式。  <br>
                        ② 将一个大于 32767 的长整数赋给整型变量，会得到什么结果。画出它们
                        的内存中的表示形式。  <br>
                        ③ 将一个长整数年赋给无符号变量，会得到什么结果（分别考虑该长整数
                        的值大于或等于 65535 以及小于 65535 的情况）。画出它们在内存中的表示形式。  
                        读者可以改变程序中各变量的值，以便比较。例如：<br>
                        a=65580,b=-40000,e=65535,f=65580。  <br>
                        (4) 输入以下程序  <br>
                        main(  ) <br>
                        { int i,j,m,n； <br>
                        i=8；  <br>
                        j=10； <br>
                        m=++i；  <br>
                        n=j++； <br>
                        printf("%d,%d,%d,%d",i,j,m,n)；  <br>
                        }  <br>
                        ① 运行程序，注意 i、j、m、n 各变量的值，分别作以下改动并运行。  <br>
                        ② 将第 4、5 行改为：  <br>
                        m=i++；  <br>
                        n=++j；  <br>
                        再运行。  <br>
                        ③ 将程序改为： <br>
                        main(  )  <br>
                        { int i,j；  <br>
                        i=8； <br>
                        j=10；  <br>
                        printf("%d,%d",i++,j++)；  <br>
                        }  <br>
                        ④ 在③的基础上，将 printf 语句改为： <br>
                        printf("%d,%d",++i,++j)；  <br>
                        ⑤ 再将 printf 语句改为：  <br>
                        printf("%d,%d,%d,%d",i,j,i++,j++)；  <br>
                        ⑥ 将程序改为  <br>
                        main(  )  <br>
                        { int i,m=0,n=0；  <br>
                        i=8；  <br>
                        j=10；  <br>
                        m += i++；n -= --j；  <br>
                        printf("i=%d,j=%d,m=%d,n=%d",i,j,m,n)；  <br>
                        }  <br>
                        实验三  最简单的 C 程序设计 <br>
                        实验项目名称：最简单的 C 程序设计 <br>
                        实验项目性质：普通实验 <br>
                        所属课程名称：C 语言程序设计 <br>
                        实验计划学时：1 <br>
                        
                        一、实验目的 <br>
                        1.掌握 C 语言中使用最多的一种语句——赋值语句的使用。 <br>
                        2.掌握数据的输入输出的方法，能正确使用各种格式转换符。 二、实验内容 1) 掌握各种格式转换符的正确使用方法  <br>
                        
                        ① 输入程序  <br>
                        main(  )  <br>
                        { int a,b；  <br>
                        float d,e；  <br>
                        char c1,c2；  <br>
                        double f,g；  <br>
                        long m,n；  <br>
                        unsigned int p,q；  <br>
                        a=16；b=62；  <br>
                        c1=′a′；c2=′b′；  <br>
                        d=3.56；e=-6.87；  <br>
                        f=3157.890121；g=0.123456789；  <br>
                        m=50000；n=-60000；  <br>
                        p=32768；q=40000；  <br>
                        printf("a=%d,b=%d\nc1=%c,c2=%c\nd=%6.2f,e=%6.2f\n",a,b,c1,c2,d,e)；  <br>
                        printf("f=%15.6f,g=%15.12f\nm=%ld,n=%ld\mp=%u,q=%u\n",f,g,m,n,p,q)；  <br>
                        }  <br>
                        ② 运行此程序并分析结果。  <br>
                        ③ 在此基础上，修改程序的第 8～13 行：<br>  
                        a=61；b=62；  <br>
                        c1=a；c2=b；  <br>
                        f=3157.890121；g=0.123456789；  <br>
                        d=f；e=g；  <br>
                        p=a=m=50000；q=b=n=-60000；  <br>
                        运行程序，分析结果。  <br>
                        ④ 改用 scanf 函数输入数据而不用赋值语句，scanf 函数如下：  <br>
                        scanf("%d,%d,%c,%c,%f,%f,%lf,%lf%ld,%ld,%u,%u,  <br>
                        &amp;a,&amp;b,&amp;cl,&amp;c2,&amp;d,&amp;e,&amp;m,&amp;n,&amp;p,&amp;q)；"  <br>
                        输入的数据如下：  <br>
                        61,62,a,b,3.56,-6.87,3157.890121,0.123456789,50000,-60000,37678,4000<br>
                        0↙  <br>
                        （说明：lf 和 ld 格式符分别用于输入 double 型和 long 型数据）分析运行结果。  <br>
                        ⑤ 在④的基础上将 printf 语句改为：  <br>
                        printf("a=%d,b=%d\nc1=%c,c2=%c\nd=%15.6f,e=%15.12f\n",a,b,c1,c2,d,e)<br>
                        ；  <br>
                        printf("f=%f,g=%f\nml=%d,n=%d,np =%d,q=%d\n",f,g,m,n,p,q)；  <br>
                        运行程序。  <br>
                        ⑥ 将 p、q 改用%o 格式符输出。  <br>
                        ⑦ 将 scanf 函数中的%lf 和%ld 改为%f 和%d,运行程序并观察分析结果。  <br>
                        (2)编写程序  <br>
                        设圆半径 r =1.5，圆柱高  h=3，求圆周长、圆面积、圆球表面积、圆球体积、<br>
                        圆柱体积。用 scanf 输入数据，输出计算结果。输出时要有文字说明，取小数
                        点后两位数字。  <br>
                        (3) 编程序，用 getchar 函数读入两个字符给 cl、c2，然后分别用 putchar 函<br>
                        数和 scanf 函数输出这两个字符。  <br>
                        上机运行程序，比较用 printf 和 putchar 函数输出字符的特点。 <br>
                        
                        实验四  逻辑结构程序设计 <br>
                        实验项目名称：逻辑结构程序设计 <br>
                        实验项目性质：普通实验 <br>
                        所属课程名称：C 语言程序设计 <br>
                        实验计划学时：1 <br>
                        
                        一、实验目的 1.了解 C 语言表示逻辑量的方法(以 0 代表“假”，以 1 代表“真”)； <br>
                        2.学会正确使用逻辑运算符和逻辑表达式； <br>
                        3.熟练掌握 if 语句和 switch 语句。 <br>
                        4. 结合程序掌握一些简单算法 <br>
                        5. 学习调试程序 二、实验内容和要求 先编程序，解以下问题，然后上机调试运行程序。 <br>
                        1.有一个函数 <br>
                        10113 10112 1 xx xx xx y <br>
                        用 scanf 函数输入 x 的值(分别为 x&lt;1、1～10、≥10 三种情况)，求 y 值。 <br>
                        2.给出一个百分制成绩，要求输出成绩等级‘A’，‘ B’，‘ C’，‘ D’，‘ E’。 90
                        分以上为‘A’， 80～89 分为‘B’， 70～79 分为‘C’， 60～69 分为‘D’， 60 分
                        以下为‘E’。 <br>
                        3、给一个不多于 5 位的正整数，要求： <br>
                        ① 求出它是几位数; <br>
                        ② 分别打印出每一位数字; <br>
                        ③ 按逆序打印出各位数字，例如原数为 321，应输出 123。 <br>
                        应准备以下测试数据：  <br>
                        ·要处理的数为 1 位正整数；  <br>
                        ·要处理的数为 2 位正整数；  <br>
                        ·要处理的数为 3 位正整数；  <br>
                        ·要处理的数为 4 位正整数；  <br>
                        ·要处理的数为 5 位正整数；  <br>
                        除此之外，程序还应当对不合法的输入作必要的处理。例如：  <br>
                        ·输入负数；  <br>
                        ·输入的数超过 5 位（如 123456）。  <br>
                        4.输入四个整数，要求按大小顺序输出。 <br>
                        
                        实验五  循环结构程序设计 <br>
                        实验项目名称：循环结构程序设计 <br>
                        实验项目性质：普通实验 <br>
                        所属课程名称：C 语言程序设计 <br>
                        实验计划学时：1 <br>
                        
                        一、实验目的 1.熟悉用 while 语句，do-while 语句和 for 语句实现循环的方法。 <br>
                        2.掌握在程序设计中用循环的方法实现各种算法(如穷举、迭代、递推等)。 <br>
                        3.进一步学习调试程序 二、实验内容和要求 编程序并上机调试运行。 <br>
                        1.输入两个正整数 m 和 n，求其中最大公约数和最小公倍数。 <br>
                        在运行时，输入的值 m&gt;n，观察结果是否正确。 <br>
                        再输入时，m&lt;n 使观察结果是否正确。 <br>
                            修改程序，不论 m 和 n 为何值（包括负整数），都能得到正确结果。 <br>
                        2.输入一行字符，分别统计出其中的英文字母、空格、数字和其它字符的个数。<br>
                        
                        3.用牛顿迭代法求方程 2x3-4x2+3x-6=0 在 1.5 附近的根。 <br>
                        4.猴子吃桃问题。猴子第一天摘下若干个桃子，当即吃了一半，还不过瘾，又
                        多吃了一个。第二天早上又将剩下的桃子吃掉一半，又多吃了一个。以后每天
                        早上都吃了前一天剩下的一半零一个。到第 10 天早上想再吃时，见只剩一个桃
                        子了。求第一天共摘下多少个桃子。 <br>
                        实验六  数组 <br>
                        实验项目名称：数组 实验项目性质：普通实验 <br>
                        所属课程名称：C 语言程序设计 <br>
                        实验计划学时：2 <br>
                        
                        一、实验目的 1.掌握一维数组和二维数组的定义、赋值和输入输出的方法； 
                        2.掌握字符数组和字符串函数的使用。 <br>
                        3.掌握与数组有关的算法(特别是排序算法)。 <br>
                        二、实验内容和要求  编程序并上机调试运行。 <br>
                        1.用选择法对 10 个整数排序。10 个整数用 scanf 函数输入。 <br>
                        2.有 15 个数存放在一个数组中，输入一个数，要求用折半查找法找出该数是数
                        组中第几个元素的值。如果该数不在数组中，则输出“无此数”。以 15 个数用
                        赋初值的方法在程序中给出。要找的数用 scanf 函数输入。 <br>
                        3.将两个字符串连接起来，不要用 strcat 函数。 <br>
                        4.找出一个二维数组的“鞍点”，即该位置上的元素在该行上最大，在该列上最
                        小。也可能没有鞍点。 <br>
                        此二维数组可以设定如下： <br>
                          891013210 1966090 40205809<br>
                        
                        数组元素的值用赋初值方法在程序中指定。 <br>
                        实验七  函数 <br>
                        实验项目名称：函数 实验项目性质：普通实验 <br>
                        所属课程名称：C 语言程序设计 <br>
                        实验计划学时：3 <br>
                        
                        一、实验目的 1.掌握定义函数的方法； <br>
                        2.掌握函数实参与形参的对应关系，以及“值传递”的方式； <br>
                        3.掌握函数的嵌套调用和递归调用的方法； <br>
                        4.掌握全局变量和局部变量，动态变量和静态变量的概念和使用方法。 <br>
                        二、实验内容与要求 编程序并上机调试运行之。 <br>
                        1.写一个判断素数的函数，在主函数输入一个整数，输出是否是素数的信息。 
                        2.用一个函数来实现将一行字符串中最长的单词输出。此行字符串从主函数传
                        递给该函数。 <br>
                        3.用递归法将一个整数转换成字符串。例如：输入 483，应输出字符串“483”。
                        n 的位数不确定，可以是任意的整数。 <br>
                        4.求两个整数的最大公约数和最小公倍数，用一个函数求最大公约数。用另一
                        函数根据求出的最大公约数求最小公倍数。 <br>
                        （1）用全局变量的方法。将两个整数的最大公约数、最小公倍数都设为全局变
                        量。 <br>
                        （2）不用全局变量，两个整数在主函数中输入，并传送给函数 1，求出的最大
                        公约数返回主函数，然后再与两个整数一起作为实参传递给函数 2，以求出最小
                        公倍数，返回到主函数输出最大公约数和最小公倍数。 <br>
                        5.写一函数，输入一个十六进制数，输出相应的十进制数。 <br>
                        实验八  指针 <br>
                        实验项目名称：指针 实验项目性质：普通实验 <br>
                        所属课程名称：C 语言程序设计 <br>
                        实验计划学时：3 <br>
                        
                        一、实验目的 1.掌握指针的概念，会定义和使用指针变量； <br>
                        2.学会使用数组的指针和指向数组的指针变量； <br>
                        3.学会使用字符串的指针和指向字符串的指针变量； <br>
                        4.学会使用指向函数的指针变量； <br>
                        5.了解指向指针的指针的概念及其使用方法。 <br>
                        二、实验内容与要求 编程序并上机调试运行程序（都要求用指针处理）。 <br>
                        1.输入三个整数，按由小到大的顺序输出，然后将程序改为：输入三个字符串，
                        按由小到大顺序输出。 <br>
                        2.将一个 3*3 的矩阵转置，用一函数实现之。在主函数中用 scanf 函数输入以
                        下矩阵元素： <br>
                                
                            
                             191513 1197 531
                        
                        将数组名作为函数实参。函数调用后在主函数中输出已转置的矩阵。 
                        3.用一个函数实现两个字符串的比较，即自己写一个 strcmp 函数： 
                        strcmp(s1,s2) <br>
                        如果 s1=s2，则函数返回值为 0；如果 s1≠s2，返回它们二者第一个不同字符的
                        ASCII 码差值(如“ BOY”与“ BAD”，第二个字母不同，“O”与“ A”之差为 79-65=14)；<br>
                        如果 s1&gt;s2，则输出正值；如 s1&lt;s2 则输出负值。 <br>
                        两个字符串 s1,s2 由 main 函数输入，strcmp 函数的返回值也在 main 函数输出。<br>
                        
                        4.写一个用矩形法求定积分的通用函数，分别求： 1 0 sin xdx     1 1 cosxdx   2 0 dxe x <br>
                        (说明：sin、cos、exp 函数已在系统的数学函数库中，程序开头要用#include 
                        “math.”)。 <br>
                        5.用指向指针的指针的方法对 n 个整数排序并输出。要求将排序单独写成一个
                        函数，n 和各整数在主函数中输入。最后在主函数中输出。 <br>
                        实验九  结构体和共体 <br>
                        实验项目名称：结构体和共用体 实验项目性质：普通实验 <br>
                        所属课程名称：C 语言程序设计 <br>
                        实验计划学时：3 <br>
                        
                        一、实验目的 1.掌握结构体类型变量的定义和使用； <br>
                        2.掌握结构体类型数组的概念和应用； <br>
                        3.掌握链表的概念，初步学会对链表进行操作； <br>
                        4.掌握共用体的概念与使用。 <br>
                        二、实验内容与要求 编程序，然后上机调试运行。 <br>
                        1.有 5 个学生，每个学生的数据包括学号、姓名、三门课的成绩，从键盘输入 5
                        个学生数据，要求打印出三门课总平均成绩，以及最高分的学生的数据（包括
                        学号、姓名、三门课的成绩、平均分数）。 <br>
                        要求用一个 input 函数输入 5 个学生数据；用一个 average 函数求总平均分；
                        用 max 函数找出最高分学生数据；总平均分和最高分的学生的数据都在主函数
                        中输出。 <br>
                        2.13 个人围成一圈，从第 1 个人开始顺序报号 1,2,3。凡报到“3”者退出圈子，
                        找出最后留在圈子中的人原来的序号。 <br>
                        3.建立一个链表，每个结点包括：学号、姓名、性别、年龄。输入一个年龄，
                        如果链表中的结点所包含的年龄等于此年龄，则将此结点删去。 <br>
                        4.输入和运行以下程序： <br>
                        union data <br>
                        {int i[2]; <br>
                        float a; <br>
                        long b; <br>
                        char c[4]; <br>
                        }; <br>
                        main( ) <br>
                        {union data u; <br>
                        scanf(“%d,%d”,&amp;u.i[0],&amp;u.i[1]); <br>
                        printf(“i[0]=%d,i[1]=%d\na=%f\nb=%ld\nc[0]=%c,c[1]=%c,c[2]=%c,c[3]=
                        %c\n”,u.i[0],u.i[1],u.a,u.b,u.c[0],u.c[1],u.c[2],u.c[3]); <br>
                        } <br>
                        输入两个整数 10000、20000 给 u.i[0]和 u.i[1]。 
                        分析运行结果。 <br>
                        然后将 scanf 语句改为： <br>
                        scanf(“%ld”,&amp;u.b); <br>
                        输入 60000 给 b。分析运行结果。 <br>
                        实验十一 位运算 <br>
                        一、目的要求 <br>
                        1.掌握按位运算的概念和方法，学会使用位运算符； <br>
                        2.学会通过位运算实现对某些位的操作。 <br>
                        二、实验内容 <br>
                        编写程序，上机调试并运行。 <br>
                        1.编写一程序，检查所用的计算机系统的 C 编译在执行右移时是按照逻辑右移的
                        原则还是按照算术右移的原则？如果是逻辑右移，请编一个函数实现算术右移。<br>
                        如果是算术右移，请编一个函数实现逻辑右移。 <br>
                        2.编一个函数 getbits，从一个 16 位的单元中取出某几位(即该几位保留原值，其
                        余位为 0)。函数调用形式为： <br>
                        getbits(value,n1,n2) <br>
                        value 为该 16 位数的值，n1 为欲取出的起始位，n2 为欲取出的的结束位。如： <br>
                        getbits(0101675,5,8) <br>
                        表示对八进制数 101675，取出其从左面起的第 5 位到第 8 位。 <br>
                        要求把这几位数用八进制数打印出来。注意，应当将这几位数右移到最右端，
                        然后用八进制形式输出。 <br>
                        3.设计一个函数，使给出一个数的原码，能得到该数的补码，用八进制形式输入
                        和输出。 <br>
                        <br>
                        实验十  文件（选作） <br>
                        实验项目名称：文件 实验项目性质：普通实验 <br>
                        所属课程名称：C 语言程序设计 <br>
                        实验计划学时：1 <br>
                        
                        一、实验目的 1.掌握文件以及缓冲文件系统、文件指针的概念； <br>
                        2.学会使用文件打开、关闭、读、写等文件操作函数。 <br>
                        3.学会用缓冲文件系统对文件进行简单的操作。 二、实验内容与要求 编写程序并上机调试运行。 <br>
                        1.有 5 个学生，每个学生有 3 门课的成绩，从键盘输入以上数据(包括学生号、
                        姓名、三门课成绩)，计算出平均成绩，将原有数据和计算出的平均分数存放在
                        磁盘文件“stud”中。 <br>
                        2.将上题“stud”文件中的学生数据，按平均分进行排序处理，将已排序的学
                        生数据存入一个新文件“stu-sort”中。 <br>
                        3.将上题已排序的学生成绩文件进行插入处理。插入一个学生的三门课成绩。
                        程序先计算新插入学生的平均成绩，然后将它按成绩高低顺序插入，插入后建
                        立一个新文件。 <br>
                        学生的原有数据为： <br>
                        91101    Wang    89,98,67.5 <br>
                        91103    Li       60,80,90 <br>
                        91106    Fun      75.5,91.5,99 <br>
                        91110    Ling     100,50,62.5 <br>
                        91113    Yuan     58,68,71 <br>
                        要插入的学生数据为： <br>
                        91108    Xin      90,95,60 <br>
                    </p>
               </div>
               <!-- end学习指南  -->
               <!--课程规划-->
                <div class="container-right" v-if="chooseIndex == 13">

               </div>
               <!-- end课程规划  -->
           </div>
        </Content>
        <Footer class="footer">
            <span>@版权所有</span>
            <span class="footer-span">广东工业大学计算机学院QG工作室</span>
        </Footer>
    </Layout>
</template>
<script>
	
import {mapState, mapActions} from 'vuex'
import navheader from '../../../components/navheader.vue'
	export default {
		name: 'practical',
		components:{navheader},
		data(){
			return {
                index: 5,
                chooseIndex: 10,
                fileIP: 'https://qgstudio.org/course/resources/'
			}
        },
        mounted() {

        },
		computed: {

			// 从这里引入 vueX 的 state 的变量到组件中用
			...mapState('user' ,{
				// 这里用到的是 es6 的函数写法
                'user': state => {
                    return state
				},
            }),
		},
		methods:{
            chooseTitle (index) {
                    this.chooseIndex = index

            }
		},
		created: function () {

        },


	}
</script>
